---
kind: property
id: P:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.ServiceId
source: html/899d635d-243b-cc1c-defa-338a36afabfe.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.ServiceId Property

The identifier for the fabrication service.

## Syntax (C#)
```csharp
public int ServiceId { get; }
```